## 数学函数

print("================= 内置函数大全演示 =================")
print("================= 作者：Askia =================")
print()
print("================= 数学函数开始 =================")
## 1. abs(x) ==> 返回绝对值
n = abs(-5)
print(f"-5的绝对值是{n}")

## 2. divmod(a, b) ==> 返回商和余数的元组 (a//b, a%b)
ret = divmod(10, 3)
print(f"10除以3的返回值是{ret[0]}, 余数是{ret[1]}")

## 3. pow(x, y[, z]) ==> 返回x**y，若提供z, 则返回(x**y) % z。
ret = pow(2, 10)
print(f"2的10次方等于{ret}")
ret = pow(2, 10, 1000)
print(f"2的10次方和1000取余数等于{ret}")

## 4. round(x[, n]) ==> 四舍五入，`n` 为小数位数。
ret = round(3.14159, 2)
print(f"3.14159四舍五入保留两位小数 = {ret}")


## 5. `sum(iterable, start=0) ==> 求和，从 `start` 开始累加。
ret = sum([1,2,3,4,5,6,7,8,9,10])
print(f"1+2+...+10={ret}")
ret = sum([1,2,3,4,5,6,7,8,9,10], 4)
print(f"5+...+10={ret}")

## 6. max(a,b,c,d,e...) ==> 求最大值
ret = max(1, 5, 3)
print(f"1, 5, 3中的最大值是 = {ret}")

## 7. min(a,b,c,d,e...) ==> 求最小值
ret = min(1, 5, 3)
print(f"1, 5, 3中的最小值是 = {ret}")
print("================= 数学函数结束 =================")
print()





